#define _CRT_SECURE_NO_WARNINGS 1

#include<stdio.h>

//int main()
//{	
//	int a = 12;
//	// 0000000000000000000000000000001100 - 12
//	// 1111111111111111111111111111110011 - 按位取反 - 原码
//	// 1000000000000000000000000000001100 - 按位取反 - 反码
//	// 1000000000000000000000000000001101 - 按位取反 - 补码 - (-13)
//	// 负数在计算机中以补码形式存储
//  // 正数的按位取反(~)所得结果为补码
//	int b = ~a;
//
//	printf("%d", b);
//
//	return 0;
//}

//int main()
//{
//	int i = 0, a = 0, b = 2, c = 3, d = 4;
//	// i = a++ && ++b && d++;
//	i = a++ || ++b || d++;
//	printf("a = %d\nb = %d\nc = %d\nd = %d\n", a, b, c, d);
//	return 0;
//}


